# 5. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

from math import *

def distance(x1, y1, x2, y2):
    return(round(sqrt((x1 - x2)**2 + (y1 - y2)**2), 2))

x1 = float(input('Введите координату x точки A: '))
y1 = float(input('Введите координату y точки A: '))
x2 = float(input('Введите координату x точки B: '))
y2 = float(input('Введите координату y точки B: '))
print('Расстояние между точками A и B равно', distance(x1, y1, x2, y2))
